In [1]:
import numpy as np
import pandas as pd

In [2]:
float_data = pd.Series([1.2, -3.5, np.nan, 0])

In [3]:
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [4]:
float_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data = pd.Series(["aardvark", np.nan, None, "avocado"])

In [6]:
string_data

0    aardvark
1         NaN
2        None
3     avocado
dtype: object

In [7]:
string_data.isnull()
string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [8]:
float_data = pd.Series([1, 2, None], dtype='float64')

In [9]:
float_data

0    1.0
1    2.0
2    NaN
dtype: float64

In [10]:
float_data.isna()

0    False
1    False
2     True
dtype: bool

In [11]:
string_data.dropna()

0    aardvark
3     avocado
dtype: object

In [12]:
string_data.fillna('Hello Ozomaki')

0         aardvark
1    Hello Ozomaki
2    Hello Ozomaki
3          avocado
dtype: object

In [13]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [14]:
bins = [18, 25, 35, 60, 100]

In [20]:
age_categories = pd.cut(ages, bins)

In [21]:
age_categories

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [22]:
age_categories2 = pd.cut(ages, bins, right = False)

In [24]:
age_categories2

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [25]:
group_names = ["Youth", "YoungAdult", "MiddleAged", "Senior"]

In [27]:
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [28]:
data = np.random.uniform(size=20)

In [29]:
data

array([0.47145747, 0.07520002, 0.70971579, 0.31704394, 0.1428517 ,
       0.62816916, 0.17153139, 0.92279428, 0.96738377, 0.97367843,
       0.47813772, 0.14600856, 0.12968049, 0.84881703, 0.64836558,
       0.52897262, 0.94496955, 0.67011491, 0.56939232, 0.30993059])

In [30]:
pd.cut(data, 4, precision=2)

[(0.3, 0.52], (0.074, 0.3], (0.52, 0.75], (0.3, 0.52], (0.074, 0.3], ..., (0.52, 0.75], (0.75, 0.97], (0.52, 0.75], (0.52, 0.75], (0.3, 0.52]]
Length: 20
Categories (4, interval[float64, right]): [(0.074, 0.3] < (0.3, 0.52] < (0.52, 0.75] < (0.75, 0.97]]

In [31]:
data = pd.DataFrame(np.random.standard_normal((1000, 4)))

In [32]:
data

            0         1         2         3
0   -0.104128  1.497945 -0.480724 -0.471595
1    0.390226  0.308836  2.432387  1.247057
2    0.248740  0.124037 -1.877059 -0.761046
3   -0.172535 -1.451424  0.269011 -0.779207
4    0.183996  0.052626 -0.879717 -0.519689
..        ...       ...       ...       ...
995 -0.888619 -0.622742 -0.289388  1.188061
996 -0.933865 -0.798441  0.366708  1.856897
997 -0.750449 -2.017232 -0.222041  0.844463
998  0.450882 -0.341573 -0.742160  0.591178
999 -1.040738  0.891826 -1.033097 -0.582096

[1000 rows x 4 columns]

In [33]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.010575    -0.041192     0.031750     0.026256
std       0.967838     1.025744     1.034194     1.024199
min      -3.638748    -4.394677    -3.279526    -3.039209
25%      -0.653022    -0.732542    -0.690809    -0.699136
50%       0.027984    -0.034834     0.048358     0.025848
75%       0.658924     0.637083     0.753192     0.719765
max       3.178837     2.794317     3.091313     3.403062

In [34]:
col = data[2]

In [36]:
col

0     -0.480724
1      2.432387
2     -1.877059
3      0.269011
4     -0.879717
         ...
995   -0.289388
996    0.366708
997   -0.222041
998   -0.742160
999   -1.033097
Name: 2, Length: 1000, dtype: float64

In [37]:
col[col.abs()>3]

77     3.091313
776   -3.279526
Name: 2, dtype: float64

In [40]:
data

            0         1         2         3
0   -0.104128  1.497945 -0.480724 -0.471595
1    0.390226  0.308836  2.432387  1.247057
2    0.248740  0.124037 -1.877059 -0.761046
3   -0.172535 -1.451424  0.269011 -0.779207
4    0.183996  0.052626 -0.879717 -0.519689
..        ...       ...       ...       ...
995 -0.888619 -0.622742 -0.289388  1.188061
996 -0.933865 -0.798441  0.366708  1.856897
997 -0.750449 -2.017232 -0.222041  0.844463
998  0.450882 -0.341573 -0.742160  0.591178
999 -1.040738  0.891826 -1.033097 -0.582096

[1000 rows x 4 columns]

In [42]:
data[(data.abs() > 3).any(axis= 'columns')]

            0         1         2         3
77   0.762692 -0.399962  3.091313  0.112261
119 -3.638748  0.656251 -1.507025 -0.584855
164 -3.531283 -0.734802 -0.756749  0.484173
177 -0.495513  0.221087 -2.465953  3.299741
368  3.107381 -0.724759  0.832656  0.569315
393  0.186532 -4.394677 -0.753487  0.597253
598  0.279539 -3.520208 -1.957665 -1.335104
623  1.028399  1.534515  0.473103  3.403062
638  0.586983 -0.914442  1.494691 -3.039209
674  3.178837 -1.436190  1.356399 -0.456109
776  0.604813  0.014193 -3.279526  0.305355
886  0.279914  0.581061  1.258954  3.254807
905  1.113928 -0.899382 -1.188945  3.129699
920  0.638157 -3.693146 -1.820332  1.998049
934 -0.085432 -4.381798  0.792214  1.491525

In [43]:
df = pd.DataFrame(np.arange(5 * 7).reshape((5, 7)))

In [44]:
df

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [45]:
sampler = np.random.permutation(5)

In [47]:
df.take(sampler)

    0   1   2   3   4   5   6
4  28  29  30  31  32  33  34
2  14  15  16  17  18  19  20
1   7   8   9  10  11  12  13
0   0   1   2   3   4   5   6
3  21  22  23  24  25  26  27

In [48]:
df.iloc[sampler]

    0   1   2   3   4   5   6
4  28  29  30  31  32  33  34
2  14  15  16  17  18  19  20
1   7   8   9  10  11  12  13
0   0   1   2   3   4   5   6
3  21  22  23  24  25  26  27

In [50]:
df.take(sampler, axis= 'columns')

    4   2   1   0   3
0   4   2   1   0   3
1  11   9   8   7  10
2  18  16  15  14  17
3  25  23  22  21  24
4  32  30  29  28  31